NAME
    access - determine existence or accessibility of named file

SYNOPSIS
    access(name [, mode])

TYPES
    name	string
    mode	integer or string containing only 'r', 'w', 'x' characters

    return	null value or error

DESCRIPTION
    access(name) or access(name, 0) or access(name, "") returns the null
    value if a file with this name exists.

    If non-null mode is specified, the null value is returned if there
    is a file with the specified name and accessibility indicated by the
    bits or characters of the mode argument: 'r' or bit 2 for reading,
    'w' or bit 1 for writing, 'x' or bit 0 for execution.

EXAMPLE
    The system error-numbers and messages may differ for different
	implementations

    > !rm -f junk
    > access("junk")
	System error 2
    > strerror(.)
	"No such file or directory"
    > f = fopen("junk", "w")
    > access("junk")
    > fputs(f, "Alpha")
    > fclose(f)
    > !chmod u-w junk
    > access("junk", "w")
	System error 13
    > strerror(.)
	"Permission denied"

LIMITS
    There may be implementation-dependent limits inherited from the
    system call "access" used by this function.

LINK LIBRARY
    none

SEE ALSO
    fopen, fclose, isfile, files

## Copyright (C) 1999  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.2 $
## @(#) $Id: access,v 29.2 2000/06/07 14:02:33 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/access,v $
##
## Under source code control:	1996/04/30 03:36:20
## File existed as early as:	1996
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
