NAME
    blocks - return a named block or number of unfreed named blocks

SYNOPSIS
    blocks([id])

TYPES
    id		non-negative integer

    return	named block or null value

DESCRIPTION
    With no argument blocks() returns the number of blocks that have
    been created but not freed by the blkfree function.

    With argument id less than the number of named blocks that have been
    created, blocks(id) returns the named block with identifying index id.
    These indices 0, 1, 2, ... are assigned to named blocks in the order
    of their creation.

EXAMPLE

    > A = blk("alpha")
    > B = blk("beta") = {1,2,3}
    > blocks()
	2
    > blocks(1)
	block 1: beta
	chunksize = 256, maxsize = 256, datalen = 3
	010203
    > blocks(2)
	Error 10211
    > strerror()
	"Non-allocated index number for blocks"

LIMITS
    none

LINK LIBRARY
    none

SEE ALSO
    blk, blkfree

## Copyright (C) 1999  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.3 $
## @(#) $Id: blocks,v 29.3 2002/07/10 11:47:04 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/blocks,v $
##
## Under source code control:	1997/04/05 13:07:13
## File existed as early as:	1997
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
