NAME
    pop - pop a value from front of a list

SYNOPSIS
    pop(lst)

TYPES
    lst		list, &list

    return	any

DESCRIPTION
     This function removes index 0 and returns it.

     This function is equivalent to calling delete(lst, 0).

EXAMPLE
    > lst = list(2,"three")

    list (2 elements, 2 nonzero):
      [[0]] = 2
      [[1]] = "three"

    > pop(lst)
	    2
    > print lst

    list (1 elements, 1 nonzero):
      [[0]] = "three"

    > pop(lst)
	    "three"
    > print lst
    list (0 elements, 0 nonzero)
    > pop(lst)
    > print lst
    list (0 elements, 0 nonzero)

LIMITS
    none

LINK LIBRARY
    none

SEE ALSO
    append, delete, insert, islist, list, push, remove, rsearch, search, size

## Copyright (C) 1999  Landon Curt Noll
##
## Calc is open software; you can redistribute it and/or modify it under
## the terms of the version 2.1 of the GNU Lesser General Public License
## as published by the Free Software Foundation.
##
## Calc is distributed in the hope that it will be useful, but WITHOUT
## ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
## or FITNESS FOR A PARTICULAR PURPOSE.	 See the GNU Lesser General
## Public License for more details.
##
## A copy of version 2.1 of the GNU Lesser General Public License is
## distributed with calc under the filename COPYING-LGPL.  You should have
## received a copy with calc; if not, write to Free Software Foundation, Inc.
## 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.
##
## @(#) $Revision: 29.2 $
## @(#) $Id: pop,v 29.2 2000/06/07 14:02:33 chongo Exp $
## @(#) $Source: /usr/local/src/cmd/calc/help/RCS/pop,v $
##
## Under source code control:	1994/03/19 03:13:20
## File existed as early as:	1994
##
## chongo <was here> /\oo/\	http://www.isthe.com/chongo/
## Share and enjoy!  :-)	http://www.isthe.com/chongo/tech/comp/calc/
